Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/atdf/PIC32CM2532JH00032.atdf
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" count="8" initval="0x00000000" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x3"/>
          <bitfield name="PRI1" caption="Priority of interrupt n" mask="0x300"/>
          <bitfield name="PRI2" caption="Priority of interrupt n" mask="0x30000"/>
          <bitfield name="PRI3" caption="Priority of interrupt n" mask="0x3000000"/>
        </register>
      </register-group>
    </module>
    <module name="NVMCTRL" id="03929" version="1a0" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLA__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLA__CMDEX"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000080" caption="Control B">
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0x1E" values="NVMCTRL_CTRLB__RWS"/>
          <bitfield name="MANW" caption="Manual Write" mask="0x80"/>
          <bitfield name="SLEEPPRM" caption="Power Reduction Mode during Sleep" mask="0x300" values="NVMCTRL_CTRLB__SLEEPPRM"/>
          <bitfield name="READMODE" caption="NVM Read Mode" mask="0x30000" values="NVMCTRL_CTRLB__READMODE"/>
          <bitfield name="CACHEDIS" caption="Cache Disable" mask="0xC0000" values="NVMCTRL_CTRLB__CACHEDIS"/>
        </register>
        <register name="PARAM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="NVM Parameter">
          <bitfield name="NVMP" caption="NVM Pages" mask="0xFFFF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x70000" values="NVMCTRL_PARAM__PSZ"/>
          <bitfield name="DFP" caption="Data Flash Pages" mask="0xFFF00000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SERR" caption="Single Bit Error Detection Flag bit Disable" mask="0x100"/>
          <bitfield name="DERR" caption="Double Bit Error Detection Flag bit Disable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="Fault Capture interrupt enable bit Disable" mask="0x1000000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SERR" caption="Single Bit Error Detection Flag bit Enable" mask="0x100"/>
          <bitfield name="DERR" caption="Double Bit Error Detection Flag bit Enable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="Fault Capture interrupt enable bit Enable" mask="0x1000000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="READY" caption="NVM Ready" mask="0x1" values="NVMCTRL_INTFLAG__READY"/>
          <bitfield name="ERROR" caption="Error" mask="0x2" values="NVMCTRL_INTFLAG__ERROR"/>
          <bitfield name="SERR" caption="Single Bit Error Detection Flag" mask="0x100"/>
          <bitfield name="DERR" caption="Double bit Error detection flag" mask="0x200"/>
          <bitfield name="FLASHERR" caption="FLASH Err" mask="0x800"/>
          <bitfield name="FLTCAP" caption="Fault Capture Interrupt" mask="0x1000000"/>
        </register>
        <register name="STATUS" offset="0x18" rw="RW" size="2" initval="0x0000" caption="Status">
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x1"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x8"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x10"/>
          <bitfield name="SB" caption="Security Bit Status" mask="0x100"/>
        </register>
        <register name="ADDR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0x3FFFFF"/>
        </register>
        <register name="LOCK" offset="0x20" rw="RW" size="2" initval="0x0000" caption="Lock Section">
          <bitfield name="LOCK" caption="Region Lock Bits" mask="0xFFFF"/>
        </register>
        <register name="PBLDATA0" offset="0x28" rw="R" size="4" initval="0xFFFFFFFF" caption="Page Buffer Load Data 0">
          <bitfield name="PBLDATA" caption="Page Buffer Load Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="PBLDATA1" offset="0x2C" rw="R" size="4" initval="0xFFFFFFFF" caption="Page Buffer Load Data 1">
          <bitfield name="PBLDATA" caption="Page Buffer Load Data" mask="0xFFFFFFFF"/>
        </register>
